Autodesk.Revit.UI.IExtendedPropertiesUIServerProxy.ShowLinkDlg(Autodesk.Revit.DB.Document,Autodesk.Revit.UI.ExtendedPropertiesLinkUIData)
The method that Revit will invoke to show extended properties dialog.
document:
The associated document.
data:
The extended properties link ui data.
Returns:
Indicates whether the extended properties ui server is executed successfully.
Since:
2027

Autodesk.Revit.UI.IExtendedPropertiesUIServerProxy.GetDBServerId
Implement this method to return the id of the server which is associated with this UI server.
Remarks:
If there's no DB server associated with this UI server, an empty GUID value will be returned.
Returns:
The id of the associated DB server.
Since:
2027